{
"all-upgrade-dragon-kill.name": "§d§nOrigin Upgrade",
    "all-upgrade-dragon-kill.description": "§5➠ Special: §7Killing the Ender Dragon will upgrade your Origin into a more powerful version.",
    "bard-passive-extra-trinkets.name": "§b§nTrinket Master",
    "bard-passive-extra-trinkets.description": "§3➠ Passive: §7Gain an additional artifact slot for belts, necklaces, and hands.",
    "bard-passive-ult-charge.name": "§b§nSymphonic Melodiam",
    "bard-passive-ult-charge.description": "§3➠ Passive: §7Apply Symphonic to yourself for 10 seconds every 10 seconds, causing your next attack to apply Encore for 30 seconds to the entity hit. Encore gives +2% additional ultimate charge to all players in a 20 block range when the entity dies.",
    "bard-primary-upgrade.name": "§a§nSong: Renewal",
    "bard-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Summon a harp to play a song for 2 seconds. After finishing, apply §dFeeding Melody 2§7 for §d10 seconds§7, and §dOverheal 2 §7for §d2 minutes§7, to you and any nearby players in a 15 block range where the harp was. Feeding Melody causes hunger to be rapidly filled. Overheal applies Absorption and §dHealth Boost§7, with the amount received scaling to your max health, and the minimum of receiving Absorption 30 and Health Boost 30. 60 second cooldown.",
    "bard-primary.name": "§a§nSong: Renewal",
    "bard-primary.description": "§2➠ Primary Ability: §7Summon a harp to play a song for 2 seconds. After finishing, apply Feeding Melody for 5 seconds, and Overheal for 60 seconds, to you and any nearby players in a 15 block range where the harp was. Feeding Melody causes hunger to be rapidly filled. Overheal applies Absorption, with the amount received scaling to your max health, and the minimum of receiving Absorption 15. 60 second cooldown.",
    "bard-secondary-upgrade.name": "§a§nSong: Inspire",
    "bard-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Summon a harp to play a song for 2 seconds. After finishing, players within a 15 block range where the harp was will fully recharge abilities that require a resource or charge. Additionally, gain §dHealing Ballad 2§7 for §d30 seconds§7, causing attacks to gain leech, healing for +2% max health with a slight cooldown between attacks. If max health is lower than 200, heal for +2 hearts instead. Recharge effect does not affect ultimate abilities or abilities with cooldowns. 40 second cooldown.",
    "bard-secondary.name": "§a§nSong: Inspire",
    "bard-secondary.description": "§2➠ Secondary Ability: §7Summon a harp to play a song for 2 seconds. After finishing, players within a 15 block range where the harp was will fully recharge abilities that require a resource or charge. Additionally, gain Healing Ballad for 15 seconds, causing attacks to gain leech, healing for +1% max health with a slight cooldown between attacks. If max health is lower than 200, heal for +1 heart instead. Recharge effect does not affect ultimate abilities or abilities with cooldowns. 40 second cooldown.",
    "bard-tertiary-upgrade.name": "§a§nSong: Empower",
    "bard-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Summon a harp to play a song for 2 seconds. After finishing, apply §dEmpowered 2§7 for §d20 seconds§7 to you and any nearby players in a 15 block range where the harp was. Empowered buffs swing speed, movement speed, swim speed, and luck. 20 second cooldown.",
    "bard-tertiary.name": "§a§nSong: Empower",
    "bard-tertiary.description": "§2➠ Tertiary Ability: §7Summon a harp to play a song for 2 seconds. After finishing, apply Empowered for 10 seconds to you and any nearby players in a 15 block range where the harp was. Empowered buffs swing speed, movement speed, swim speed, and luck. 20 second cooldown.",
    "bloodarcher-passive-blood-rot.name": "§b§nBlood Rot§9",
    "bloodarcher-passive-blood-rot.description": "§3➠ Passive: §7Your attacks apply Blood Rot for 3 seconds, dealing 2-10 physical damage per 0.5 seconds, scaling with their current health.",
    "bloodarcher-passive-clinging.name": "§b§nFlesh Crawler§9 [Toggle]",
    "bloodarcher-passive-clinging.description": "§3➠ Passive: §7You can climb any block and stick to any ceiling. Crouching while on a wall will hold you in place. Can be toggled on and off with the Quinary key.",
    "bloodarcher-passive-life-steal.name": "§b§nKilling Feast",
    "bloodarcher-passive-life-steal.description": "§3➠ Passive: §7Getting the killing blow on an entity will heal you for 4 hearts.",
    "bloodarcher-primary-upgrade.name": "§a§nBlood Shot§9 [Charge]",
    "bloodarcher-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Fire an arrow in the direction you're facing, dealing §d400-2400 physical damage§7 and applying Arrow Slice to yourself for 1 second, causing your next attack on an entity to explode into multiple arrows. These arrows have built-in piercing and recharge by 1 arrow every 5 seconds, max of §d6 arrows§7 at once.",
    "bloodarcher-primary.name": "§a§nBlood Shot§9 [Charge]",
    "bloodarcher-primary.description": "§2➠ Primary Ability: §7Fire an arrow in the direction you're facing, dealing 4-40 physical damage and applying Arrow Slice to yourself for 1 second, causing your next attack on an entity to explode into multiple arrows. These arrows have built-in piercing and recharge by 1 arrow every 5 seconds, max of 3 arrows at once.",
    "bloodarcher-secondary-upgrade.name": "§a§nBear Trap",
    "bloodarcher-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Throw down a bear trap for §d20 seconds§7, applying chains to all entities in an 11 block range. Chains apply Slowness 3 and deal §d50-1000 physical damage§7 per 0.5 seconds, scaling with their current health. 40 Second Cooldown.",
    "bloodarcher-secondary.name": "§a§nBear Trap",
    "bloodarcher-secondary.description": "§2➠ Secondary Ability: §7Throw down a bear trap for 10 seconds, applying chains to all entities in an 11 block range. Chains apply Slowness 3 and deal 5-50 physical damage per 0.5 seconds, scaling with their current health. 40 Second Cooldown.",
    "bloodarcher-tertiary-upgrade.name": "§a§nBone Banner",
    "bloodarcher-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Throw down a bone banner for §d20 seconds§7, applying §dStrength 5§7 and Ballistic to you and any nearby players in a 20 block range. Strength deals +3 additional physical damage per level. Ballistic allows bows and crossbows to be auto-fired with free piercing. Damage from auto-fired arrows scale with the Projectiles skill and enchantment level of Power. 60 second cooldown.",
    "bloodarcher-tertiary.name": "§a§nBone Banner",
    "bloodarcher-tertiary.description": "§2➠ Tertiary Ability: §7Throw down a bone banner for 10 seconds, applying Strength 2 and Ballistic to you and any nearby players in a 20 block range. Strength deals +3 additional physical damage per level. Ballistic allows bows and crossbows to be auto-fired with free piercing. Damage from auto-fired arrows scale with the Projectiles skill and enchantment level of Power. 60 second cooldown.",
    "changeling-passive-gnome.name": "§b§nThreat Detection",
    "changeling-passive-gnome.description": "§3➠ Passive: §7While Gnome Form is toggled, crouching will apply Glowing to any nearby entities in a 30 block range.",
    "changeling-passive-goblin.name": "§b§nGoblin Greed",
    "changeling-passive-goblin.description": "§3➠ Passive: §7While Goblin Form is toggled, picking up experience will apply Luck 5 to you for 20 seconds.",
    "changeling-passive-ogre.name": "§b§nBone Breaker",
    "changeling-passive-ogre.description": "§3➠ Passive: §7While Ogre Form is toggled, sprinting will throw nearby entities upwards in a 4 block range, while attacking an entity will cause them to take massive knockback, throwing them in the direction you're facing. Attack knockback may not work if entity has high knockback resistance.",
    "changeling-primary-upgrade.name": "§a§nForm: Gnome",
    "changeling-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Transform into a gnome, gaining their extremely short size. While in this form, right clicking an entity affected by Glowing will allow you to ride and control them. Cannot ride entities with above 50k health. §dYou can now deal damage in this form§7. 5 second cooldown.",
    "changeling-primary.name": "§a§nForm: Gnome",
    "changeling-primary.description": "§2➠ Primary Ability: §7Transform into a gnome, gaining their extremely short size. While in this form, right clicking an entity affected by Glowing will allow you to ride and control them. Cannot ride entities with above 50k health. This form prevents you from dealing any damage, excluding specific bypasses. 5 second cooldown.",
    "changeling-secondary-upgrade.name": "§a§nForm: Goblin",
    "changeling-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Transform into a goblin, normalizing your height. While in this form, attacking an entity will apply §dExperience Drop 2§7 for 1 second, causing them to drop §d5 times§7 their normal experience on death. 5 second cooldown.",
    "changeling-secondary.name": "§a§nForm: Goblin",
    "changeling-secondary.description": "§2➠ Secondary Ability: §7Transform into a goblin, normalizing your height. While in this form, attacking an entity will apply Experience Drop for 1 second, causing them to drop 3 times their normal experience on death. 5 second cooldown.",
    "changeling-tertiary-upgrade.name": "§a§nForm: Ogre",
    "changeling-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Transform into an ogre, gaining their extremely large size. While in this form, sprinting will break blocks in a 3x3 pattern in the direction you're facing. §dMost blocks broken now drop§7. 5 second cooldown.",
    "changeling-tertiary.name": "§a§nForm: Ogre",
    "changeling-tertiary.description": "§2➠ Tertiary Ability: §7Transform into an ogre, gaining their extremely large size. While in this form, sprinting will break blocks in a 3x3 pattern in the direction you're facing. Blocks broken do not drop. 5 second cooldown.",
    "class-damage-passive.name": "§e§nDamage Class",
    "class-damage-passive.description": "§6➠ Class Passive: §7Gain +10% attack speed and the ability to dual wield any weapon. This class is above average height, being 1.9 blocks tall.",
    "class-healer-passive.name": "§e§nHealer Class",
    "class-healer-passive.description": "§6➠ Class Passive: §7Consuming Health Elixirs gives double the amount, while also increasing the max health of any nearby players by +4 in a 20 block range. This class is average height, being 1.75 blocks tall.",
    "class-tank-passive.name": "§e§nTank Class",
    "class-tank-passive.description": "§6➠ Class Passive: §7Gain +20 armor and immunity to knockback when holding any shield in your off-hand. Additionally, all nearby mobs in a 20 block range will be unable to fly or swim upwards, forcing them down to the ground. Can be toggled on and off with the Nonary key. This class is extremely tall, being 2.2 blocks tall.",
    "class-utility-passive.name": "§e§nUtility Class",
    "class-utility-passive.description": "§6➠ Class Passive: §7Gain +2 block and attack reach, and all cursed scrolls you use have their success chance increased by +10%. This class is extremely short, being 1.6 blocks tall.",
    "dragonknight-passive-damage-aura.name": "§b§nDraconic Aura",
    "dragonknight-passive-damage-aura.description": "§3➠ Passive: §7Entities in a 20 block range take up to +100% additional damage per hit, dealt as magic damage. Removes on hit, reapplying after 1 second.",
    "dragonknight-passive-heal-buff.name": "§b§nCauterizing Wounds",
    "dragonknight-passive-heal-buff.description": "§3➠ Passive: §7Taking at least 1+ damage applies 1 stack of Cauterize to yourself for 10 seconds, capping at 10 stacks. Cauterize causes direct healing on yourself above +1 to be increased by +10% per stack.",
    "dragonknight-primary-upgrade.name": "§a§nDraconic Taunt",
    "dragonknight-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Apply Taunt for §d15 seconds§7 to all entities in a 60 block range. Taunted entities cannot target other entities, excluding the Maw Guardian. 30 second cooldown.",
    "dragonknight-primary.name": "§a§nDraconic Taunt",
    "dragonknight-primary.description": "§2➠ Primary Ability: §7Apply Taunt for 10 seconds to all entities in a 60 block range. Taunted entities cannot target other entities, excluding the Dragon Knight. 30 second cooldown.",
    "dragonknight-secondary-upgrade.name": "§a§nInfernal Blade",
    "dragonknight-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Summon a giant blade for §d20 seconds§7, 5 blocks away in the direction you're facing, to pull all entities in an 11 block range. 30 second cooldown.",
    "dragonknight-secondary.name": "§a§nInfernal Blade",
    "dragonknight-secondary.description": "§2➠ Secondary Ability: §7Summon a giant blade for 10 seconds, 5 blocks away in the direction you're facing, to pull all entities in an 11 block range. 30 second cooldown.",
    "dragonknight-tertiary-upgrade.name": "§a§nCore Fortification",
    "dragonknight-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Apply Magic Resistance and Explosive Resistance for §d20 seconds§7 to you and any nearby players in a 12 block range, causing you to be completely immune to those damage types. 40 second cooldown.",
    "dragonknight-tertiary.name": "§a§nCore Fortification",
    "dragonknight-tertiary.description": "§2➠ Tertiary Ability: §7Apply Magic Resistance and Explosive Resistance for 10 seconds to you and any nearby players in a 12 block range, causing you to be completely immune to those damage types. 40 second cooldown.",
    "earthwarden-passive-hay-maker.name": "§b§nHaymaker",
    "earthwarden-passive-hay-maker.description": "§3➠ Passive: §7Every 10 seconds, your next right click will stun any entity in place for 3 seconds. Crouch + right click can also apply the effect, if the entity has a right click use.",
    "earthwarden-passive-mine-speed.name": "§b§nBoulder Arms",
    "earthwarden-passive-mine-speed.description": "§3➠ Passive: §7Your mining and breaking speed is increased by +100%. This applies to all blocks and objects.",
    "earthwarden-passive-retrieve.name": "§b§nBarrier Crush",
    "earthwarden-passive-retrieve.description": "§3➠ Quinary Passive: §7Destroy any barriers§7 or pillars within a 6 block range.",
    "earthwarden-primary-detonation-upgrade.name": "Not Visible - Earth Warden Secondary",
    "earthwarden-primary-detonation-upgrade.description": "Not Visible - Pillar Detonation",
    "earthwarden-primary-detonation.name": "Not Visible - Earth Warden Secondary",
    "earthwarden-primary-detonation.description": "Not Visible - Pillar Detonation",
    "earthwarden-primary-upgrade.name": "§a§nMagmatic Pillar",
    "earthwarden-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Summon an explosive pillar for 30 seconds, 7 blocks away in the direction you're facing. Pressing Crouch + Primary will detonate any placed Magmatic Pillars, applying §dSundered 4§7 to all entities for §d20 seconds§7 in a 5 block radius where the pillars were. Sundered reduces total armor by 25% per level. Entities may become frightened and run from the pillar. 8 second cooldown.",
    "earthwarden-primary.name": "§a§nMagmatic Pillar",
    "earthwarden-primary.description": "§2➠ Primary Ability: §7Summon an explosive pillar for 30 seconds, 7 blocks away in the direction you're facing. Pressing Crouch + Primary will detonate any placed Magmatic Pillars, applying Sundered 2 to all entities for 10 seconds in a 10 block range where the pillars were. Sundered reduces total armor by 25% per level. Entities may become frightened and run from the pillar. 8 second cooldown.",
    "earthwarden-secondary-lift.name": "§a§nTitan Lift",
    "earthwarden-secondary-lift.description": "§2➠ Senary Ability: §7Boost any placed Stone Barriers by 1 block within a 15 block radius. 1 second cooldown.",
    "earthwarden-secondary-upgrade.name": "§a§nStone Barrier",
    "earthwarden-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Summon §d9 stone walls§7 for 6 seconds, 3 blocks away in the direction you're facing. Walls prevent all entities from passing through. Entities may become frightened and run from the walls. Pressing Crouch + Secondary will boost any placed Stone Barriers by 1 block. 6 second cooldown.",
    "earthwarden-secondary.name": "§a§nStone Barrier",
    "earthwarden-secondary.description": "§2➠ Secondary Ability: §7Summon 5 stone walls for 6 seconds, 3 blocks away in the direction you're facing. Walls prevent all entities from passing through. Entities may become frightened and run from the walls. Pressing Crouch + Secondary will boost any placed Stone Barriers by 1 block. 6 second cooldown.",
    "earthwarden-tertiary-upgrade.name": "§a§nCall of the Ancients",
    "earthwarden-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Accept Earth's gift, applying §dResistance 3§7 to you and any nearby players in a 20 block range for §d15 seconds§7. Resistance reduces incoming damage by -20% per level. 30 second cooldown.",
    "earthwarden-tertiary.name": "§a§nCall of the Ancients",
    "earthwarden-tertiary.description": "§2➠ Tertiary Ability: §7Accept Earth's gift, applying Resistance 2 to you and any nearby players in a 20 block range for 10 seconds. Resistance reduces incoming damage by -20% per level. 30 second cooldown.",
    "earthwarden-titancrusher-primary-detonation-upgrade.name": "§a§nTectonic Explosion§d [+]",
    "earthwarden-titancrusher-primary-detonation-upgrade.description": "§2➠ Quaternary Ability: §7Activate and destroy any placed Magmatic Obelisks, applying Sundered 5 to all entities for 10 seconds within a 5 block radius where the obelisks were. No cooldown.",
    "earthwarden-titancrusher-primary-upgrade.name": "§a§nMagmatic Obelisk§d [+]",
    "earthwarden-titancrusher-primary-upgrade.description": "§2➠ Primary Ability: §7Summon an explosive obelisk, 7 blocks away in the direction you're facing. Pressing Crouch + Primary will detonate any placed Magmatic Pillars, applying Sundered 2 to all entities for 10 seconds in a 5 block radius where the pillars were. 4 second cooldown.",
    "earthwarden-titancrusher-secondary-upgrade.name": "§a§nMountain Barricade§d [+]",
    "earthwarden-titancrusher-secondary-upgrade.description": "§2➠ Secondary Ability: §7Summon 9 stone walls, 3 blocks away in the direction you're facing, for 6 seconds. Walls prevent all entities from passing through. Pressing Crouch + Secondary will boost any placed Stone Barriers by 1 block. 6 second cooldown.",
    "earthwarden-titancrusher-tertiary-upgrade.name": "§a§nOne with Earth§d [+]",
    "earthwarden-titancrusher-tertiary-upgrade.description": "§2➠ Tertiary Ability: §7Accept Earth's gift, causing you and any nearby players in a 10 block radius to take 80% reduced damage for 10 seconds. Specific damage types can go through this resistance. 20 second cooldown.",
    "effect-permanent-haste.name": "§b§nSpelunker",
    "effect-permanent-haste.description": "§3Passive: §7You permanently have Haste 1 at all times. This effect makes your mining and attack speed faster.",
    "effect-permanent-luck.name": "§b§nTreasure Hunter",
    "effect-permanent-luck.description": "§3Passive: §7You permanently have Luck 3 at all times. This effect boosts drop chance and loot table rolls, fishing included.",
    "effect-permanent-natures-chosen.name": "§b§nNature's Chosen",
    "effect-permanent-natures-chosen.description": "§3➠ Passive: §7Right clicking a player will apply Chosen to them for 3 minutes. When taking at least 4+ damage, Chosen causes the player to convert 25% of damage taken to health to any nearby players in a 11 block range. Does not heal the initial player affected by the effect. Choosing another player will wipe it from the previous.",
    "effect-permanent-no-map.name": "§c§n§kNothing",
    "effect-permanent-no-map.description": "§0➠ Curse: §7You cannot use the minimap or world map.",
    "effect-permanent-shadow-step.name": "§b§nDevious Intentions",
    "effect-permanent-shadow-step.description": "§3➠ Passive: §7Apply Shadow Step to yourself at all times, allowing your attacks to entities to apply Stun for 6 seconds. Further attacks will cause them to break out of their stun, however dealing 10+ more attacks has a 20% chance to stun them again. Additionally, you can right click entities to disarm their off-hand item while you're affected by Invisibility.",
    "immunity-blind.name": "§b§nIntimdation Immunity",
    "immunity-blind.description": "§3➠ Passive: §7You are immune to Intimidation.",
    "immunity-drown.name": "§b§nDrown Immunity",
    "immunity-drown.description": "§3➠ Passive: §7You are immune to Drown damage.",
    "immunity-fall.name": "§b§nFall Immunity",
    "immunity-fall.description": "§3➠ Passive: §7You are immune to Fall damage.",
    "immunity-fire.name": "§b§nFire Immunity",
    "immunity-fire.description": "§3➠ Passive: §7You are immune to Fire damage.",
    "immunity-hunger.name": "§b§nHunger Immunity",
    "immunity-hunger.description": "§3➠ Passive: §7You are immune to Hunger.",
    "immunity-levitation.name": "§b§nLevitation Immunity",
    "immunity-levitation.description": "§3➠ Passive: §7You are immune to Levitation.",
    "immunity-lightning.name": "§b§nLightning Immunity",
    "immunity-lightning.description": "§3➠ Passive: §7You are immune to Lightning damage.",
    "immunity-mining-fatigue.name": "§b§nMining Fatigue Immunity",
    "immunity-mining-fatigue.description": "§3➠ Passive: §7You are immune to Mining Fatigue.",
    "immunity-nausea.name": "§b§nNausea Immunity",
    "immunity-nausea.description": "§3➠ Passive: §7You are immune to Nausea.",
    "immunity-poison.name": "§b§nPoison Immunity",
    "immunity-poison.description": "§3➠ Passive: §7You are immune to Poison.",
    "immunity-slowness.name": "§b§nSlowness Immunity",
    "immunity-slowness.description": "§3➠ Passive: §7You are immune to Slowness.",
    "immunity-suffocation.name": "§b§nSuffocation Immunity",
    "immunity-suffocation.description": "§3➠ Passive: §7You are immune to Suffocation damage.",
    "immunity-weakness.name": "§b§nWeakness Immunity",
    "immunity-weakness.description": "§3➠ Passive: §7You are immune to Weakness.",
    "immunity-wither.name": "§b§nWither Immunity",
    "immunity-wither.description": "§3➠ Passive: §7You are immune to Wither.",
    "imp-blooddemon-primary-upgrade.name": "§a§nDemonic Launch§d [+]",
    "imp-blooddemon-primary-upgrade.description": "§2Primary Ability: §7Launch yourself with +4 leap power in the direction you're facing. 3 second cooldown.",
    "imp-blooddemon-secondary-upgrade.name": "§a§nLucifer's Whispers§d [+]",
    "imp-blooddemon-secondary-upgrade.description": "§2Secondary Ability: §7Gain Speed 5 for 8 seconds and apply Invisibility 1 for 8 seconds to you and any nearby players in a 10 block radius. Attacking or getting caught while invisible will make you visible again. 12 second cooldown.",
    "imp-blooddemon-tertiary-upgrade.name": "§a§nHell Crush§d [+]",
    "imp-blooddemon-tertiary-upgrade.description": "§2Tertiary Ability: §7Launch yourself with +8 leap power downwards. 3 second cooldown.",
    "imp-passive-ground-slam.name": "§b§nHoof Stomp",
    "imp-passive-ground-slam.description": "§3Passive: §7Falling for at least 6 blocks will cause a shockwave upon landing, applying Stun 1 for 4 seconds to all entities in a 4 block radius. This effect prevents mobs from moving.",
    "imp-passive-lava-walk.name": "§b§nBoiling Blood",
    "imp-passive-lava-walk.description": "§3➠ Passive: §7You can swim and walk on lava. Press prone while sprinting to swim.",
    "imp-primary-upgrade.name": "§a§nDemonic Leap",
    "imp-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Launch yourself with §d+6 leap power§7 in the direction you're facing. 8 second cooldown.",
    "imp-primary.name": "§a§nDemonic Leap",
    "imp-primary.description": "§2➠ Primary Ability: §7Launch yourself with +3 leap power in the direction you're facing. 8 second cooldown.",
    "imp-secondary-upgrade.name": "§a§nWhispers of Hell",
    "imp-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Apply Invisibility and §dSpeed 7§7 for 10 seconds to you and any nearby players in a 20 block range. Entities cannot see you until you become visible again, but may be able to spot and attack you when attacked themselves. §d20 second cooldown§7.",
    "imp-secondary.name": "§a§nWhispers of Hell",
    "imp-secondary.description": "§2➠ Secondary Ability: §7Apply Invisibility and Speed 4 for 10 seconds to you and any nearby players in a 20 block range. Entities cannot see you until you become visible again, but may be able to spot and attack you when attacked themselves. 30 second cooldown.",
    "imp-tertiary-upgrade.name": "§a§nHell Dive",
    "imp-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Launch yourself with §d+12 leap power§7 downwards. 4 second cooldown.",
    "imp-tertiary.name": "§a§nHell Dive",
    "imp-tertiary.description": "§2➠ Tertiary Ability: §7Launch yourself with +6 leap power downwards. 4 second cooldown.",
    "owlkin-passive-nightvision.name": "§b§nOwl's Eyes§9 [Toggle]",
    "owlkin-passive-nightvision.description": "§3➠ Senary Passive: §7Toggle to apply Night Vision to yourself.",
    "owlkin-passive-rune-empowerment.name": "§b§nRune Empowerment§9 [Toggle]",
    "owlkin-passive-rune-empowerment.description": "§3➠ Quinary Passive: §7Toggle to apply Rune Infusion to yourself, causing your attacks to have a 50% chance to deal up to +100% additional damage as magic damage. Drains Mana by 5 per hit.",
    "owlkin-primary-upgrade.name": "§a§nSnow Ball§d [25 Mana]",
    "owlkin-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Summon a snowball in the direction you're facing, dealing §d100-3000 magic damage§7 to all entities in an 8 block range, scaling with their current health. Hitting a direct shot will apply §dSnowed 2§7 for §d10 seconds§7 to the entity hit, causing additional less stronger snowballs to rain from above.",
    "owlkin-primary.name": "§a§nSnow Ball§9 [25 Mana]",
    "owlkin-primary.description": "§2➠ Primary Ability: §7Summon a snowball in the direction you're facing, dealing 10-100 magic damage to all entities in an 8 block range, scaling with their current health. Hitting a direct shot will apply Snowed for 5 seconds to the entity hit, causing additional less stronger snowballs to rain from above.",
    "owlkin-resource-mana.name": "§d§nMana",
    "owlkin-resource-mana.description": "§5➠ Resource: §7You are infused with magical powers, giving you Mana as a resource to cast spells. Mana recharges by 5 every second. Max Mana: 100.",
    "owlkin-secondary-upgrade.name": "§a§nFlame Aura§9 [Drain]",
    "owlkin-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Toggle to apply §dFlame Aura 2§7 to yourself. Flame Aura applies fire chains that deal §d50-1000 magic damage§7 per 0.5 seconds to all entities in an 11 block range, scaling with their current health. §dNow drains Mana slower while active§7.",
    "owlkin-secondary.name": "§a§nFlame Aura§9 [Drain]",
    "owlkin-secondary.description": "§2➠ Secondary Ability: §7Toggle to apply Flame Aura to yourself. Flame Aura applies fire chains that deal 5-50 magic damage per 0.5 seconds to all entities in an 11 block range, scaling with their current health. Drains Mana while active.",
    "owlkin-tertiary-upgrade.name": "§a§nStar Form§9 [Drain]",
    "owlkin-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Toggle to split from your physical body, allowing you to walk through walls. §dNow drains Mana slower while active§7.",
    "owlkin-tertiary.name": "§a§nStar Form§9 [Drain]",
    "owlkin-tertiary.description": "§2➠ Tertiary Ability: §7Toggle to split from your physical body, allowing you to walk through walls. Drains Mana while active.",
    "satyrdruid-passive-bone-meal.name": "§b§nBountiful Grace§9 [Toggle]",
    "satyrdruid-passive-bone-meal.description": "§3➠ Quinary Passive: §7Toggle to periodically apply bone meal on crops below you.",
    "satyrdruid-primary-upgrade.name": "§a§nFungal Spores",
    "satyrdruid-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Apply §dFungal Spores 2§7 for 20 seconds to you and any nearby players in a 20 block range, causing all incoming healing to be §dtripled§7. 40 second cooldown.",
    "satyrdruid-primary.name": "§a§nFungal Spores",
    "satyrdruid-primary.description": "§2➠ Primary Ability: §7Apply Fungal Spores for 20 seconds to you and any nearby players in a 20 block range, causing all incoming healing to be doubled. 40 second cooldown.",
    "satyrdruid-secondary-upgrade.name": "§a§nCleansing Waters",
    "satyrdruid-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Remove all bad potion effects on you and any nearby players in a 10 block range. Cannot remove Critical Wounds or effects from bosses with red names. §d8 second cooldown§7.",
    "satyrdruid-secondary.name": "§a§nCleansing Waters",
    "satyrdruid-secondary.description": "§2➠ Secondary Ability: §7Remove all bad potion effects on you and any nearby players in a 10 block range. Cannot remove Critical Wounds or effects from bosses with red names. 15 second cooldown.",
    "satyrdruid-tertiary-upgrade.name": "§a§nNature's Call§9 [Toggle]",
    "satyrdruid-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Toggle to transform into a centaur, applying §dRevitalization 2§7 to you and any nearby players in a 10 block range while active, healing for §d+2% max health§7 every 0.5 seconds. This form increases your movement speed, swim speed, jump height, and step height, but also makes you taller. If max health is lower than 200, heal for +2 hearts instead.",
    "satyrdruid-tertiary.name": "§a§nNature's Call§9 [Toggle]",
    "satyrdruid-tertiary.description": "§2➠ Tertiary Ability: §7Toggle to transform into a centaur, applying Revitalization to you and any nearby players in a 10 block range while active, healing for +1% max health every 0.5 seconds. This form increases your movement speed, swim speed, jump height, and step height, but also makes you taller. If max health is lower than 200, heal for +1 heart instead.",
    "soulwarlock-passive-prevent-death.name": "§b§nDefiance",
    "soulwarlock-passive-prevent-death.description": "§3➠ Passive: §7Taking lethal damage will transform you into a skeleton for 10 seconds, preventing all incoming damage, then receiving fatal damage after the effect expires. If you have a Totem of Undying in your inventory, you will instead be resurrected after the timer has finished. Resets on death.",
    "soulwarlock-passive-summon-buff.name": "§b§nDeath's Empower",
    "soulwarlock-passive-summon-buff.description": "§3➠ Passive: §7Dealing damage has a 10% chance to apply Strength 2 for 10 seconds to your currently summoned minions. Additionally, getting the killing blow on an entity has a 25% chance to summon a free spider minion, lasting for 30 seconds.",
    "soulwarlock-primary-upgrade.name": "§a§nSpider Summon§9 [25 Souls]",
    "soulwarlock-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Summon §d2 spiders§7 under your command for §d4 minutes§7. Dealing damage or being attacked by an entity will command your spider to attack. Right clicking the spider will command it to sit and stop attacking. Crouching and pressing primary again will teleport any currently summoned spider minions to you.",
    "soulwarlock-primary.name": "§a§nSpider Summon§9 [25 Souls]",
    "soulwarlock-primary.description": "§2➠ Primary Ability: §7Summon a spider under your command for 2 minutes. Dealing damage or being attacked by an entity will command your spider to attack. Right clicking the spider will command it to sit and stop attacking. Crouching and pressing primary again will teleport any currently summoned spider minions to you.",
    "soulwarlock-resource-souls.name": "§d§nSouls",
    "soulwarlock-resource-souls.description": "§5➠ Resource: §7You are infused with Souls for casting spells. Apply Soul Steal every second to entities in a 20 block range, causing the entity to give you +5 souls on death. Effect removes from entity if you walk too far away. Max Souls: 100.",
    "soulwarlock-secondary-upgrade.name": "§a§nSoul Split§9 [Toggle]",
    "soulwarlock-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Transform into a spirit, applying §dSpirit Shift 2§7 to yourself while toggled. Spirit Shift drains your experience levels by -1 to recharge your souls by §d+10§7 every second.",
    "soulwarlock-secondary.name": "§a§nSoul Split§9 [Toggle]",
    "soulwarlock-secondary.description": "§2➠ Secondary Ability: §7Transform into a spirit, applying Spirit Shift to yourself while toggled. Spirit Shift drains your experience levels by -1 to recharge your souls by +5 every second.",
    "soulwarlock-tertiary-upgrade.name": "§a§nSoul Crystal§d [25 Souls]",
    "soulwarlock-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Summon a floating crystal for §d2 minutes§7, applying §dSoul Rip 2§7 to you, minions, and any nearby players in a 10 block range. Soul Rip causes killed entities to deal §d2500-12500 magic damage§7 to nearby entities in a 10 block range, scaling with their max health. Minions will keep the soul rip effect for the duration of the crystal, even if not next to it.",
    "soulwarlock-tertiary.name": "§a§nSoul Crystal§9 [25 Souls]",
    "soulwarlock-tertiary.description": "§2➠ Tertiary Ability: §7Summon a floating crystal for 60 seconds, applying Soul Rip to you, minions, and any nearby players in a 10 block range. Soul Rip causes killed entities to deal 250-1250 magic damage to nearby entities in a 10 block range, scaling with their max health. Minions will keep the soul rip effect for the duration of the crystal, even if not next to it.",
    "survivalist-ability-active-none.name": "§c§n§kNothing",
    "survivalist-ability-active-none.description": "§0➠ Curse: §7You have no active abilities.",
    "survivalist-ability-passive-none.name": "§c§n§kNothing",
    "survivalist-ability-passive-none.description": "§0➠ Curse: §7You have no positive passives.",
    "survivalist-damage-slowness.name": "§c§n§kNothing",
    "survivalist-damage-slowness.description": "§0➠ Curse: §7Gain Slowness 3 for 2 seconds when taking damage.",
    "survivalist-heal-enemy.name": "§c§n§kNothing",
    "survivalist-heal-enemy.description": "§0➠ Curse: §7Entities that attack you have a 25% chance to heal themselves by +1000.",
    "survivalist-immunity-heal.name": "§c§n§kNothing",
    "survivalist-immunity-heal.description": "§0➠ Curse: §7You are immune to Invisibility and Regeneration.",
    "survivalist-increased-damage.name": "§c§n§kNothing",
    "survivalist-increased-damage.description": "§0➠ Curse: §7All damage taken is increased by 3x.",
    "survivalist-mine-speed.name": "§c§n§kNothing",
    "survivalist-mine-speed.description": "§0➠ Curse: §7Your mining speed is permanently reduced by -50%.",
    "survivalist-no-upgrade.name": "§c§n§kNothing",
    "survivalist-no-upgrade.description": "§0➠ Curse: §7Your Origin does not upgrade when killing the Ender Dragon.",
    "survivalist-reduced-artifacts.name": "§c§n§kNothing",
    "survivalist-reduced-artifacts.description": "§0➠ Curse: §7All artifact slots are removed, excluding the Skill Cloak slot.",
    "survivalist-start-gear.name": "§c§n§kNothing",
    "survivalist-start-gear.description": "§0➠ Curse: §7You are forced to wear permanent leather equipment at all times.",
    "templar-passive-horse-summon.name": "§b§nJusticiar's Steed",
    "templar-passive-horse-summon.description": "§3➠ Quinary Passive: §7Summon a purified Spectral Steed lasting for 60 seconds. When walking on water, the Spectral Steed will convert it to ice. Pressing Crouch + Quinary will teleport it back to you. 3 minute cooldown.",
    "templar-passive-prevent-death.name": "§b§nSaving Grace",
    "templar-passive-prevent-death.description": "§3➠ Passive: §7Prevent dying once when taking fatal damage. Resets on death.",
    "templar-primary-upgrade.name": "§a§nHoly Grenade§9 [Charge]",
    "templar-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Throw a splash potion of healing in the direction you're facing, healing any players around the splash for §d+25% max health§7. If max health is lower than 100, heal for +25 hearts instead. Recharge 1 potion every 5 seconds, max of §d6 potions§7 at once.",
    "templar-primary.name": "§a§nHoly Grenade§9 [Charge]",
    "templar-primary.description": "§2➠ Primary Ability: §7Throw a splash potion of healing in the direction you're facing, healing any players around the splash for +12.5% max health. If max health is lower than 100, heal for +12.5 hearts instead. Recharge 1 potion every 5 seconds, max of 3 potions at once.",
    "templar-secondary-upgrade.name": "§a§nAscendance",
    "templar-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Transform into an angel for §d20 seconds§7, doubling your healing and applying Guardian Angel to you and any nearby players in a 20 block range. Guardian Angel prevents dying to fatal damage, but may bypass immunity if taken too quickly. 60 second cooldown.",
    "templar-secondary.name": "§a§nAscendance",
    "templar-secondary.description": "§2➠ Secondary Ability: §7Transform into an angel for 10 seconds, doubling your healing and applying Guardian Angel to you and any nearby players in a 20 block range. Guardian Angel prevents dying to fatal damage, but may bypass immunity if taken too quickly. 60 second cooldown.",
    "templar-tertiary-upgrade.name": "§a§nHealing Aura",
    "templar-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Heal yourself and any nearby players for §d+50% max health§7 in a 20 block range. If max health is lower than 100, heal for +25 hearts instead. 25 second cooldown.",
    "templar-tertiary.name": "§a§nHealing Aura",
    "templar-tertiary.description": "§2➠ Tertiary Ability: §7Heal yourself and any nearby players for +25% max health in a 20 block range. If max health is lower than 100, heal for +12.5 hearts instead. 25 second cooldown.",
    "ultimate-damage-quaternary.name": "§e§nMeltdown§e [ULT]",
    "ultimate-damage-quaternary.description": "§6➠ Quaternary Ability: §7Charge up for 1 second and release a wave of energy, applying Brittleness for 15 seconds to entities in a 60 block range, causing their armor value to be added to dealt damage. Recharges by 1% per killed entity or taking 4+ damage.",
    "ultimate-healer-quaternary.name": "§e§nResurrection§e [ULT]",
    "ultimate-healer-quaternary.description": "§6➠ Quaternary Ability: §7Charge up for 1 second and release a wave of energy, resurrecting and fully healing yourself and all downed players in a 20 block range. Clears Critical Wounds on use. Recharges by 1% per killed entity or taking 4+ damage.",
    "ultimate-tank-quaternary.name": "§e§nWar Horn§e [ULT]",
    "ultimate-tank-quaternary.description": "§6➠ Quaternary Ability: §7Charge up for 1 second and release a war call, applying Damage Suppression for 15 seconds to you and any nearby players in a 20 block range. Damage Suppression prevents all incoming damage. Recharges by 1% per killed entity or taking 4+ damage.",
    "ultimate-utility-quaternary.name": "§e§nAcceleration§e [ULT]",
    "ultimate-utility-quaternary.description": "§6➠ Quaternary Ability: §7Charge up for 1 second and release a wave of energy, instantly recharging all players ultimates to 100% in a 20 block range. Does not apply to yourself or other players on Utility Origins. Recharges by 1% per killed entity or taking 4+ damage.",
    "voidwyvern-passive-ender-chest.name": "§b§nEnder Containment",
    "voidwyvern-passive-ender-chest.description": "§3➠ Senary Passive: §7You can open and access your Ender Chest at any moment.",
    "voidwyvern-passive-symbiosis.name": "§b§nSymbiote",
    "voidwyvern-passive-symbiosis.description": "§3➠ Quinary Passive: §7Apply Symbiosis to yourself for 20 seconds, allowing you to right click a player to enter spectator mode and spectate them. Crouching will remove you from spectating and put you back into your physical form. 20 second cooldown.",
    "voidwyvern-primary-portal-end-location-upgrade.name": "§a§nVoid Portal Teleport Location",
    "voidwyvern-primary-portal-end-location-upgrade.description": "§2Primary Ability: Places a portal below your feet that teleports allies and minions from the first portal - this isn't visible normally.",
    "voidwyvern-primary-portal-end-location.name": "§a§nVoid Portal Teleport Location",
    "voidwyvern-primary-portal-end-location.description": "§2Primary Ability: Places a portal below your feet that teleports allies and minions from the first portal - this isn't visible normally.",
    "voidwyvern-primary-upgrade.name": "§a§nAbyssal Portal",
    "voidwyvern-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Summon an entrance portal below you for §d2 minutes§7. Pressing Crouch + Primary will summon an exit portal. These portals can teleport you, players, minions, and any summons that are from other Origins. Does not teleport enemy entities. 15 second cooldown.",
    "voidwyvern-primary.name": "§a§nAbyssal Portal",
    "voidwyvern-primary.description": "§2➠ Primary Ability: §7Summon an entrance portal below you for 60 seconds. Pressing Crouch + Primary will summon an exit portal. These portals can teleport you, players, minions, and any summons that are from other Origins. Does not teleport enemy entities. 15 second cooldown.",
    "voidwyvern-resource-void.name": "§d§nVoid Resource",
    "voidwyvern-resource-void.description": "§5Resource: §7Void resource for Void Form ability. Void recharges by 2 every second. Max Void: 100.",
    "voidwyvern-secondary-upgrade.name": "§a§nShadow Steal",
    "voidwyvern-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Purge any equipped armor from all entities in a 10 block range. Does not purge weapons, shields, or off-hand items. §d15 second cooldown§7.",
    "voidwyvern-secondary.name": "§a§nShadow Steal",
    "voidwyvern-secondary.description": "§2➠ Secondary Ability: §7Purge any equipped armor from all entities in a 10 block range. Does not purge weapons, shields, or off-hand items. 30 second cooldown.",
    "voidwyvern-tertiary-upgrade.name": "§a§nVoid Form§9 [Charge]",
    "voidwyvern-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Toggle to enter your void form, allowing you to fly and preventing all fall damage. Press V to fly and again to slowly descend. Cannot fly if on low hunger. §dNow lasts twice as long§7.",
    "voidwyvern-tertiary.name": "§a§nVoid Form§9 [Charge]",
    "voidwyvern-tertiary.description": "§2➠ Tertiary Ability: §7Toggle to enter your void form, allowing you to fly and preventing all fall damage. Press V to fly and again to slowly descend. Cannot fly if on low hunger.",
    "wendigo-passive-kill-hunger.name": "§b§nRip And Tear",
    "wendigo-passive-kill-hunger.description": "§3➠ Passive: §7Apply Corpse Feast every second to all entities in a 20 block range, causing the entity to feed you by +3 food and +3 saturation on death. Effect removes from entity if you walk too far away.",
    "wendigo-passive-projectile-reflect.name": "§b§nHardened Fur",
    "wendigo-passive-projectile-reflect.description": "§3➠ Passive: §7Destroy one incoming projectile every 6 seconds.",
    "wendigo-primary-upgrade.name": "§a§nWinter Fury§9 [6 Hunger]",
    "wendigo-primary-upgrade.description": "§d[+] §2➠ Primary Ability: §7Apply Frozen for §d10 seconds§7 to all entities in a 20 block range, immobilizing and preventing them from attacking. Entities previously frozen will have a magic blue circle below them and cannot be refrozen for 5 seconds.",
    "wendigo-primary.name": "§a§nWinter Fury§9 [6 Hunger]",
    "wendigo-primary.description": "§2➠ Primary Ability: §7Apply Frozen for 5 seconds to all entities in a 20 block range, immobilizing and preventing them from attacking. Entities previously frozen will have a magic blue circle below them and cannot be refrozen for 5 seconds.",
    "wendigo-secondary-upgrade.name": "§a§nFrozen Bolster§9 [6 Hunger]",
    "wendigo-secondary-upgrade.description": "§d[+] §2➠ Secondary Ability: §7Apply §dMonstrous 8§7 for §d60 seconds§7 to you and any nearby players in a 20 block range, giving §d+24 armor§7, immunity to knockback, and heals on low health.",
    "wendigo-secondary.name": "§a§nFrozen Bolster§9 [6 Hunger]",
    "wendigo-secondary.description": "§2➠ Secondary Ability: §7Apply Monstrous 4 for 30 seconds to you and any nearby players in a 20 block range, giving +12 armor, immunity to knockback, and heals on low health.",
    "wendigo-tertiary-upgrade.name": "§a§nCannibal Vengeance§9 [Drain]",
    "wendigo-tertiary-upgrade.description": "§d[+] §2➠ Tertiary Ability: §7Toggle to apply §dCounter Claw 2§7 to you and any nearby players in a 12 block range, causing §dall§7 damage you take to be dealt back as piercing typeless damage to all entites in a 12 block range. Drains hunger while active.",
    "wendigo-tertiary.name": "§a§nCannibal Vengeance§9 [Drain]",
    "wendigo-tertiary.description": "§2➠ Tertiary Ability: §7Toggle to apply Counter Claw to you and any nearby players in a 12 block range, causing a large portion of damage you take to be dealt back as piercing typeless damage to all entites in a 12 block range. Drains hunger while active."
}